# HSDNet model configuration
# YOLO11 Fusion Model with Enhanced P3 SE_SPDConv + SplitOmniFusion and Detect_SEPS

# Parameters
nc: 6  # number of classes
scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# Backbone
backbone:
  - [-1, 1, Conv, [64, 3, 2]]      # 0 - P1/2
  - [-1, 1, Conv, [128, 3, 2]]     # 1 - P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]
  - [-1, 1, Conv, [256, 3, 2]]     # 3 - P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]
  - [-1, 1, Conv, [512, 3, 2]]     # 5 - P4/16
  - [-1, 2, C3k2, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]]    # 7 - P5/32
  - [-1, 2, C3k2, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]]
  - [-1, 2, C2PSA, [1024]]

# Head
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]]           # P4
  - [-1, 2, C3k2, [512, False]]         # 13

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [2, 1, SE_SPDConv, [256]]              # 15
  - [[-1, -2, 4], 1, Concat, [1]]       # P3 Fusion
  - [-1, 1, SplitOmniFusion, []]          # 17
  - [-1, 2, C3k2, [256, False]]         # 18 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 13], 1, Concat, [1]]          # P4 Fusion
  - [-1, 2, C3k2, [512, False]]         # 21 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 10], 1, Concat, [1]]          # P5 Fusion
  - [-1, 2, C3k2, [1024, True]]         # 24 (P5/32-large)

  - [[18, 21, 24], 1, Detect_SEPS, [nc, 256]]


